<?php
// ДЗ 1 Задание 6
// Вывести таблицу умножения и у определённых чисел изменить форматирование (добавить скобки)
echo('<table>');
for ($i = 1; $i <= 10; $i++) {
  echo('<tr>');
  for ($t = 1; $t <= 10; $t++) {
      echo('<td>');
      if ($i % 2 === 0 && $t % 2 === 0){
          echo('(' . $i*$t . ')');
      } elseif ($i % 2 !== 0 && $t % 2 !== 0) {
          echo('[' . $i*$t . ']');
      } else {
          echo($i*$t);
      }
      echo('</td>');
  }
  echo('</tr>');
}
echo('/<table>');

